"//button[text()='Войти в аккаунт']" # Кнопка 'Войти в аккаунт'
"//input[@name='name']" # Поле 'Email'
"//input[@name='Пароль']" # Поле 'Пароль'
"//button[text()='Войти']" # Кнопка 'Войти'
"//h1[text()='Соберите бургер']" # Заголовок 'Соберите бургер'
"//*[contains(@href,'/account')]" # Кнопка 'Личный кабинет'
"//h2[text()='Вход']" # Ссылка с надписью 'Вход'
"//h2[text()='Регистрация']" # Ссылка с надписью 'Регистрация'
"//h2[text()='Восстановление пароля']" # Ссылка с надписью 'Восстановление пароля'
"//*[contains(@href,'/account')]" # Кнопка 'Личный кабинет'
"//a[text()='Профиль']" # Ссылка с надписью 'Профиль'
"//button[text()='Выход']" # Кнопка 'Выход'
'AppHeader_header__logo__2D0X2' # Лого Stella Burger
"//div[contains(@class, 'tab_tab__1SPyG')]" # Заголовки разделов "Булки", "Соусы", "Начинки"
"//div[@style='display: flex;']" # Блок, включающий названия разделов "Булки", "Соусы", "Начинки"
"//h2[text()='Булки']" # Название раздела 'Булки' в области, которая имеет скролл
"//h2[text()='Соусы']" # Название раздела 'Соусы' в области, которая имеет скролл
"//h2[text()='Начинки']" # Название раздела 'Начинки' в области, которая имеет скролл
'.BurgerIngredients_ingredients__menuContainer__Xu3Mo' # скролл в области с компонентами для сборки бургера
"//label[text()='Имя']/following-sibling::*" # Поле 'Имя'
"//label[text()='Email']/following-sibling::*" # Поле 'Email'
"//label[text()='Пароль']/following-sibling::*" # Поле 'Пароль'
"//button[text()='Зарегистрироваться']" # Кнопка 'Зарегистрироваться'
"//*[contains(text(), 'Некорректный')]" # Надпись 'Некорректный пароль'